# Pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data1={'Country': ['Belgium', 'India', 'Brazil'], 
      'Capital': ['Brussels', 'New Delhi', 'Brasilia'], 
      'Population': [11190846, 1303171035, 2078475281]}

In [3]:
data2 = {'Team': {'L.Aldridge': 'SA', 'D.DeRozan': 'SA'}, 
         'Position': {'L.Aldridge': 'PF/C', 'D.DeRozan': 'PG/SG'}, 
         'Number': {'L.Aldridge': '12', 'D.DeRozan': '10'}}

### 1

In [4]:
s1 = Series(data1['Country'])
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [6]:
s1.index

RangeIndex(start=0, stop=3, step=1)

### 2

In [7]:
s2 = Series(data1['Country'], index=['A', 'B', 'C'])

In [8]:
s2

A    Belgium
B      India
C     Brazil
dtype: object

In [9]:
s2.index

Index(['A', 'B', 'C'], dtype='object')

In [10]:
s2.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

### 3

In [11]:
# 由 Python 的 dict 创建 DataFrame

# dict 中的 key --> columns index or columns label
# dicr 中的 value --> row
df1 = DataFrame(data1)
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia  2078475281

In [12]:
# 也是由 Python 的 dict 创建 DataFrame，但是注意 dict
df2 = DataFrame(data2)
df2

           Team Position Number
L.Aldridge   SA     PF/C     12
D.DeRozan    SA    PG/SG     10

### 4

In [13]:
df2

           Team Position Number
L.Aldridge   SA     PF/C     12
D.DeRozan    SA    PG/SG     10

In [14]:
df2.iterrows()

In [15]:
# 如何遍历 DataFrame 的行
for row in df2.iterrows():
    print(row)
    print(type(row))
    print()

('L.Aldridge', Team          SA
Position    PF/C
Number        12
Name: L.Aldridge, dtype: object)
<class 'tuple'>

('D.DeRozan', Team           SA
Position    PG/SG
Number         10
Name: D.DeRozan, dtype: object)
<class 'tuple'>

In [16]:
for row in df2.iterrows():
    print(row)
    print()
    print(type(row))
    print()
    print(len(row))
    print()
    print(row[0])
    print()
    print(type(row[0]))
    print()
    print(row[1])
    print()
    print(type(row[1]))
    print('--------------------------')

('L.Aldridge', Team          SA
Position    PF/C
Number        12
Name: L.Aldridge, dtype: object)

<class 'tuple'>

2

L.Aldridge

<class 'str'>

Team          SA
Position    PF/C
Number        12
Name: L.Aldridge, dtype: object

<class 'pandas.core.series.Series'>
--------------------------
('D.DeRozan', Team           SA
Position    PG/SG
Number         10
Name: D.DeRozan, dtype: object)

<class 'tuple'>

2

D.DeRozan

<class 'str'>

Team           SA
Position    PG/SG
Number         10
Name: D.DeRozan, dtype: object

<class 'pandas.core.series.Series'>
--------------------------

In [17]:
print('Main players at SA:\n')
for row in df2.iterrows():
    print(row[0])

Main players at SA:

L.Aldridge
D.DeRozan

### 5

In [19]:
# 转置
df3 = df2.T
df3

         L.Aldridge D.DeRozan
Team             SA        SA
Position       PF/C     PG/SG
Number           12        10

### 6

In [20]:
data2

{'Team': {'L.Aldridge': 'SA', 'D.DeRozan': 'SA'},
 'Position': {'L.Aldridge': 'PF/C', 'D.DeRozan': 'PG/SG'},
 'Number': {'L.Aldridge': '12', 'D.DeRozan': '10'}}

In [21]:
# 由 Series 创建 DataFrame

s3 = Series(data2['Team'])
s3

L.Aldridge    SA
D.DeRozan     SA
dtype: object

In [22]:
s4 = Series(data2['Position'])
s4

L.Aldridge     PF/C
D.DeRozan     PG/SG
dtype: object

In [23]:
s5 = Series(data2['Number'])
s5

L.Aldridge    12
D.DeRozan     10
dtype: object

In [24]:
df4 = DataFrame([s3, s4, s5])
df4

  L.Aldridge D.DeRozan
0         SA        SA
1       PF/C     PG/SG
2         12        10

In [25]:
df5 = DataFrame([s3, s4, s5], index=['Team', 'Position', 'Number'])
df5

         L.Aldridge D.DeRozan
Team             SA        SA
Position       PF/C     PG/SG
Number           12        10

### 7

In [26]:
data1

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 2078475281]}

In [34]:
s6 = Series(data1['Country'])
s7 = Series(data1['Capital'])
s8 = Series(data1['Population'])
df6 = DataFrame([s6, s7, s8], index=['Country', 'Capital', 'Population'])
df6.columns=['1', '2', '3']
df6

                   1           2           3
Country      Belgium       India      Brazil
Capital     Brussels   New Delhi    Brasilia
Population  11190846  1303171035  2078475281

In [35]:
df6.T

   Country    Capital  Population
1  Belgium   Brussels    11190846
2    India  New Delhi  1303171035
3   Brazil   Brasilia  2078475281